; domain
(define (domain zeno-travel)
(:requirements :typing :strips)
(:types transportable city flevel - object
        aircraft person - transportable)

(:predicates (at ?x - transportable ?c - city)
             (in ?a - aircraft ?p - person)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (next ?l1 - flevel ?l2 - flevel))


(:action board
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (at ?a ?c)
                 (at ?b ?c))
 :effect (and (not (at ?a ?c))
              (in ?a ?b)))

(:action debark
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (in ?a ?b)
                 (at ?b ?c))
 :effect (and (not (in ?a ?b))
              (at ?a ?c)))

(:action fly
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d))
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?e)))

(:action zoom
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel ?f - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d)
		 (next ?f ?e)
		)
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?f)
	)
)

(:action refuel
 :parameters (?a - aircraft ?b - city ?c - flevel ?d - flevel)

 :precondition (and (fuel-level ?a ?c)
                 (next ?c ?d)
                 (at ?a ?b))
 :effect (and (fuel-level ?a ?d) (not (fuel-level ?a ?c))))


)

; problem
(define (problem ZTRAVEL-7-9)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	plane6 - aircraft
	plane7 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	city10 - city
	city11 - city
	city12 - city
	city13 - city
	city14 - city
	city15 - city
	city16 - city
	city17 - city
	city18 - city
	city19 - city
	city20 - city
	city21 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city4)
	(fuel-level plane1 fl2)
	(at plane2 city12)
	(fuel-level plane2 fl0)
	(at plane3 city20)
	(fuel-level plane3 fl1)
	(at plane4 city14)
	(fuel-level plane4 fl1)
	(at plane5 city9)
	(fuel-level plane5 fl0)
	(at plane6 city10)
	(fuel-level plane6 fl0)
	(at plane7 city20)
	(fuel-level plane7 fl6)
	(at person1 city0)
	(at person2 city12)
	(at person3 city16)
	(at person4 city4)
	(at person5 city12)
	(at person6 city16)
	(at person7 city13)
	(at person8 city13)
	(at person9 city14)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at plane1 city12)
	(at plane3 city10)
	(at plane7 city21)
	(at person1 city2)
	(at person2 city13)
	(at person3 city1)
	(at person4 city13)
	(at person5 city10)
	(at person6 city19)
	(at person7 city21)
	(at person8 city20)
	(at person9 city17)
	))

)

; plan
1. (fly plane7 city20 city0 fl6 fl5)
   deleted: (at plane7 city20) (fuel-level plane7 fl6)
   added: (at plane7 city0) (fuel-level plane7 fl5)
   goals met: 0 of 12
2. (zoom plane7 city0 city13 fl5 fl4 fl3)
   deleted: (at plane7 city0) (fuel-level plane7 fl5)
   added: (at plane7 city13) (fuel-level plane7 fl3)
   goals met: 0 of 12
3. (board person8 plane7 city13)
   deleted: (at person8 city13)
   added: (in person8 plane7)
   goals met: 0 of 12
4. (zoom plane7 city13 city16 fl3 fl2 fl1)
   deleted: (at plane7 city13) (fuel-level plane7 fl3)
   added: (at plane7 city16) (fuel-level plane7 fl1)
   goals met: 0 of 12
5. (board person6 plane7 city16)
   deleted: (at person6 city16)
   added: (in person6 plane7)
   goals met: 0 of 12
6. (board person3 plane7 city16)
   deleted: (at person3 city16)
   added: (in person3 plane7)
   goals met: 0 of 12
7. (board person9 plane4 city14)
   deleted: (at person9 city14)
   added: (in person9 plane4)
   goals met: 0 of 12
8. (fly plane4 city14 city17 fl1 fl0)
   deleted: (at plane4 city14) (fuel-level plane4 fl1)
   added: (at plane4 city17) (fuel-level plane4 fl0)
   goals met: 0 of 12
9. (debark person9 plane4 city17)
   deleted: (in person9 plane4)
   added: (at person9 city17)
   goals met: 1 of 12
10. (fly plane3 city20 city10 fl1 fl0)
   deleted: (at plane3 city20) (fuel-level plane3 fl1)
   added: (at plane3 city10) (fuel-level plane3 fl0)
   goals met: 2 of 12
11. (board person5 plane2 city12)
   deleted: (at person5 city12)
   added: (in person5 plane2)
   goals met: 2 of 12
12. (refuel plane2 city12 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 2 of 12
13. (board person2 plane2 city12)
   deleted: (at person2 city12)
   added: (in person2 plane2)
   goals met: 2 of 12
14. (board person4 plane1 city4)
   deleted: (at person4 city4)
   added: (in person4 plane1)
   goals met: 2 of 12
15. (fly plane2 city12 city10 fl1 fl0)
   deleted: (at plane2 city12) (fuel-level plane2 fl1)
   added: (at plane2 city10) (fuel-level plane2 fl0)
   goals met: 2 of 12
16. (refuel plane2 city10 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 2 of 12
17. (debark person5 plane2 city10)
   deleted: (in person5 plane2)
   added: (at person5 city10)
   goals met: 3 of 12
18. (fly plane2 city10 city13 fl1 fl0)
   deleted: (at plane2 city10) (fuel-level plane2 fl1)
   added: (at plane2 city13) (fuel-level plane2 fl0)
   goals met: 3 of 12
19. (board person7 plane2 city13)
   deleted: (at person7 city13)
   added: (in person7 plane2)
   goals met: 3 of 12
20. (refuel plane2 city13 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 3 of 12
21. (debark person2 plane2 city13)
   deleted: (in person2 plane2)
   added: (at person2 city13)
   goals met: 4 of 12
22. (fly plane2 city13 city21 fl1 fl0)
   deleted: (at plane2 city13) (fuel-level plane2 fl1)
   added: (at plane2 city21) (fuel-level plane2 fl0)
   goals met: 4 of 12
23. (debark person7 plane2 city21)
   deleted: (in person7 plane2)
   added: (at person7 city21)
   goals met: 5 of 12
24. (zoom plane1 city4 city13 fl2 fl1 fl0)
   deleted: (at plane1 city4) (fuel-level plane1 fl2)
   added: (at plane1 city13) (fuel-level plane1 fl0)
   goals met: 5 of 12
25. (refuel plane1 city13 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 5 of 12
26. (debark person4 plane1 city13)
   deleted: (in person4 plane1)
   added: (at person4 city13)
   goals met: 6 of 12
27. (fly plane7 city16 city1 fl1 fl0)
   deleted: (at plane7 city16) (fuel-level plane7 fl1)
   added: (at plane7 city1) (fuel-level plane7 fl0)
   goals met: 6 of 12
28. (refuel plane7 city1 fl0 fl1)
   deleted: (fuel-level plane7 fl0)
   added: (fuel-level plane7 fl1)
   goals met: 6 of 12
29. (debark person3 plane7 city1)
   deleted: (in person3 plane7)
   added: (at person3 city1)
   goals met: 7 of 12
30. (fly plane7 city1 city19 fl1 fl0)
   deleted: (at plane7 city1) (fuel-level plane7 fl1)
   added: (at plane7 city19) (fuel-level plane7 fl0)
   goals met: 7 of 12
31. (refuel plane7 city19 fl0 fl1)
   deleted: (fuel-level plane7 fl0)
   added: (fuel-level plane7 fl1)
   goals met: 7 of 12
32. (debark person6 plane7 city19)
   deleted: (in person6 plane7)
   added: (at person6 city19)
   goals met: 8 of 12
33. (fly plane7 city19 city20 fl1 fl0)
   deleted: (at plane7 city19) (fuel-level plane7 fl1)
   added: (at plane7 city20) (fuel-level plane7 fl0)
   goals met: 8 of 12
34. (refuel plane7 city20 fl0 fl1)
   deleted: (fuel-level plane7 fl0)
   added: (fuel-level plane7 fl1)
   goals met: 8 of 12
35. (debark person8 plane7 city20)
   deleted: (in person8 plane7)
   added: (at person8 city20)
   goals met: 9 of 12
36. (fly plane7 city20 city21 fl1 fl0)
   deleted: (at plane7 city20) (fuel-level plane7 fl1)
   added: (at plane7 city21) (fuel-level plane7 fl0)
   goals met: 10 of 12
37. (fly plane1 city13 city0 fl1 fl0)
   deleted: (at plane1 city13) (fuel-level plane1 fl1)
   added: (at plane1 city0) (fuel-level plane1 fl0)
   goals met: 10 of 12
38. (refuel plane1 city0 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 10 of 12
39. (board person1 plane1 city0)
   deleted: (at person1 city0)
   added: (in person1 plane1)
   goals met: 10 of 12
40. (fly plane1 city0 city2 fl1 fl0)
   deleted: (at plane1 city0) (fuel-level plane1 fl1)
   added: (at plane1 city2) (fuel-level plane1 fl0)
   goals met: 10 of 12
41. (refuel plane1 city2 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 10 of 12
42. (debark person1 plane1 city2)
   deleted: (in person1 plane1)
   added: (at person1 city2)
   goals met: 11 of 12
43. (fly plane1 city2 city12 fl1 fl0)
   deleted: (at plane1 city2) (fuel-level plane1 fl1)
   added: (at plane1 city12) (fuel-level plane1 fl0)
   goals met: 12 of 12
